import React from 'react';
import { Link } from 'react-router-dom';

const CheapFlights = () => {
  const styles = {
    body: {
      fontFamily: 'ibmReg, sans-serif',
      textAlign: 'center',
      margin: 0,
      padding: 0,
      backgroundColor: 'rgb(254, 254, 236)',
    },
    h2: {
      fontSize: '50px',
      marginTop: '50px',
      fontFamily: 'ibmMed, sans-serif',
      color: 'white',
    },
    p: {
      fontSize: '20px',
      lineHeight: '2rem',
      textAlign: 'center',
      margin: '20px auto',
      maxWidth: '80%',
      fontFamily: 'ibmReg, sans-serif',      
      color: 'white',
    },
    backButton: {
      position: 'fixed',
      top: '20px',
      right: '20px',
      backgroundColor: 'rgba(255, 255, 255, 0.05)',
      backdropFilter: 'blur(17px)',
      borderColor: 'rgba(255, 255, 255, 0.05)',
      color: 'white',
      padding: '10px 20px',
      border: 'solid',
      cursor: 'pointer',
      fontFamily: 'ibmMed, sans-serif',      
      fontSize: '20px',
      borderRadius: '10px',
      zIndex: 10000
    },
    section: {
      marginTop: '50px',
      marginBottom: '50px',
      display: 'flex',
      alignItems: 'center',
      justifyContent: 'center',
      flexDirection: 'column',
      //backgroundColor: 'rgba(255, 255, 255, 0.05)',
      //backdropFilter: 'blur(17px)'
    },
    mediaQuery: {
      '@media screen and (maxWidth: 768px)': {
        h2: {
          fontSize: '35px',
        },
        p: {
          fontSize: '16px',
          lineHeight: '20px',
        }        
      },
    },
  };

  return (
    <div>
      <head>
        <meta charSet="UTF-8" />
        <meta name="viewport" content="width=device-width, initial-scale=1.0" />
        <link type="image/png" sizes="32x32" rel="icon" href="../../img/favicon/riyad.png" />
        <title>رياض شاجرة | الطيران الإقتصادي</title>
      </head>
      <body style={styles.body}>
        <Link to={"/"}>
          <button style={styles.backButton}>رجوع</button>
        </Link>
        <section style={styles.section}>
          <h2 style={styles.h2}>الطيران الاقتصادي</h2>
          <p style={styles.p}>
            ظهر الطيران الاقتصادي كظاهرة جديدة في عالم الطيران في العقود الأخيرة، ليغير قواعد اللعبة بشكل جذري في صناعة السفر الجوي. رغم مرور سنوات قليلة على ظهوره، إلا أنه استطاع أن يحتل مكانة هامة في تاريخ الطيران.
          </p>
          <p style={styles.p}>
          كان الطيران الاقتصادي بمثابة سفينة رائدة في مجال السفر الجوي، فهو النمط الوحيد في عالم الطيران التجاري الذي استطاع تقديم رحلات بأسعار منخفضة بشكل ملحوظ، مما جعله يستحق لقب "الطيران للجميع".
          </p>
          <p style={styles.p}>
          كانت شركات الطيران الاقتصادي تتسع لعدد كبير من الركاب، حيث كانت تقدم خدماتها بأسلوب اقتصادي وعملي. بدأت أولى شركات الطيران الاقتصادي في العمل في السبعينات، ومنذ ذلك الحين، توسعت بشكل كبير في العقدين الأخيرين. ومع ذلك، كانت تواجه تحديات كبيرة في التكيف مع الطلب المتزايد وتقديم خدمات ذات جودة مقبولة.
          </p>
          <p style={styles.p}>
          لم يكن الطيران الاقتصادي مجرد خيار سفر، بل كان رمزًا للتغيير والابتكار في عالم الطيران. على الرغم من الصعاب والتحديات التي واجهتها هذه الشركات، إلا أنها لا تزال تحظى بتقدير وإعجاب العديد من المسافرين حول العالم، كرمز للوصول إلى السفر بأسعار معقولة.
          </p>
        </section>

        <section style={styles.section}>
          <h2 style={styles.h2}>الوصول إلى الوجهات</h2>
          <p style={styles.p}>
          تجسّدت أهمية الطيران الاقتصادي في قدرته على الوصول إلى وجهات متعددة وبأسعار تنافسية، حيث لعبت هذه العناصر الحاسمة دورًا مهما في جعل السفر الجوي في متناول الجميع.
          </p>
          <p style={styles.p}>
          الاستغلال الأمثل للوقت: إحدى أهم مزايا الطيران الاقتصادي كانت قدرته على تقديم رحلات مباشرة وسريعة. بفضل جدولة رحلاته المكثفة، كان بإمكان المسافرين الوصول إلى وجهاتهم بشكل أكثر فعالية.          </p>
          <p style={styles.p}>
          الكفاءة الاقتصادية: على الرغم من تكاليف التشغيل المنخفضة للطيران الاقتصادي، إلا أنه كان يهدف إلى تقديم تجربة سفر اقتصادية ومناسبة للركاب ذوي الميزانيات المحدودة. كانت هذه الشركات خيارًا شائعًا للركاب الذين يقدرون الأسعار المنخفضة.          </p>
          <p style={styles.p}>
          تحديات التكنولوجيا والإدارة: تحقيق الكفاءة التشغيلية للطيران الاقتصادي كان تحديًا إداريًا ضخمًا. تطلبت هذه الكفاءة تصميم هياكل وأساليب إدارة مبتكرة للتعامل مع التكاليف والاحتياجات اللوجستية.
          </p>
          <p style={styles.p}>
          الابتكار والإدارة: كان تصميم وتطوير الطيران الاقتصادي وتحقيق الكفاءة التشغيلية تجسيدًا للابتكار في صناعة الطيران. كانت هذه الشركات تمثل رمزًا لقدرة الإنسان على تقديم حلول مبتكرة للتحديات الاقتصادية.
          </p>
        </section>

        <section style={styles.section}>
          <h2 style={styles.h2}>الحاضر والمستقبل</h2>
          <p style={styles.p}>
          شهد الطيران الاقتصادي نجاحات كبيرة على مدار السنوات الماضية، حيث تمكن من جذب ملايين الركاب سنويًا. ومع ذلك، فقد واجه أيضًا تحديات تتعلق بالسلامة والخدمات. على الرغم من بعض الحوادث والمشكلات التشغيلية، فقد استمرت شركات الطيران الاقتصادي في تحسين خدماتها وتعزيز معايير السلامة.
          </p>
          <p style={styles.p}>
          وفي ظل الضغوط الاقتصادية المتزايدة، بدأت شركات الطيران الاقتصادي في تبني تقنيات جديدة وتحسين كفاءتها البيئية. وفي النهاية، أصبح الطيران الاقتصادي جزءًا لا يتجزأ من صناعة السفر الجوي العالمية.          </p>
          <p style={styles.p}>
          على الرغم من التحديات المستمرة، فإن تأثير الطيران الاقتصادي لا يزال حاضرًا في صناعة الطيران. تعكس تجربة الطيران الاقتصادي الفريدة والتكنولوجيا المتقدمة التي تم تطويرها خلال هذا المشروع الخبرات والمعرفة التي استفادت منها صناعة الطيران. وقد ساهمت هذه الخبرات في تطوير تقنيات ومفاهيم جديدة في مجال الطيران الاقتصادي والنقل الجوي الفعال، مما يجعل إرث الطيران الاقتصادي حيًا وملهمًا للمستقبل.
          </p>
        </section>
      </body>
    </div>
  );
};

export default CheapFlights;
