import React from 'react';
import { Link } from 'react-router-dom';

const Concorde = () => {
  const styles = {
    body: {
      fontFamily: 'ibmReg, sans-serif',
      textAlign: 'center',
      margin: 0,
      padding: 0,
      backgroundColor: 'rgb(254, 254, 236)',
    },
    h2: {
      fontSize: '50px',
      marginTop: '50px',
      fontFamily: 'ibmMed, sans-serif',
      color: 'white',
    },
    p: {
      fontSize: '20px',
      lineHeight: '2rem',
      textAlign: 'center',
      margin: '20px auto',
      maxWidth: '80%',
      fontFamily: 'ibmReg, sans-serif',      
      color: 'white',
    },
    backButton: {
      position: 'fixed',
      top: '20px',
      right: '20px',
      backgroundColor: 'rgba(255, 255, 255, 0.05)',
      backdropFilter: 'blur(17px)',
      borderColor: 'rgba(255, 255, 255, 0.05)',
      color: 'white',
      padding: '10px 20px',
      border: 'solid',
      cursor: 'pointer',
      fontFamily: 'ibmMed, sans-serif',      
      fontSize: '20px',
      borderRadius: '10px',
      zIndex: 10000
    },
    section: {
      marginTop: '50px',
      marginBottom: '50px',
      display: 'flex',
      alignItems: 'center',
      justifyContent: 'center',
      flexDirection: 'column',
      //backgroundColor: 'rgba(255, 255, 255, 0.05)',
      //backdropFilter: 'blur(17px)'
    },
    mediaQuery: {
      '@media screen and (maxWidth: 768px)': {
        h2: {
          fontSize: '35px',
        },
        p: {
          fontSize: '16px',
          lineHeight: '20px',
        }        
      },
    },
  };

  return (
    <div>
      <head>
        <meta charSet="UTF-8" />
        <meta name="viewport" content="width=device-width, initial-scale=1.0" />
        <link type="image/png" sizes="32x32" rel="icon" href="../../img/favicon/riyad.png" />
        <title>الكونكورد</title>
      </head>
      <body style={styles.body}>
        <Link to={"/"}>
          <button style={styles.backButton}>رجوع</button>
        </Link>
        <section style={styles.section}>
          <h2 style={styles.h2}>طائرة الكونكورد</h2>
          <p style={styles.p}>
            تعرف العالم في فترة السبعينات على طائرة كونكورد، هذه العجوز الأنيقة التي جسدت تحفة الهندسة
            المشتركة بين بريطانيا وفرنسا. برغم مضي سنوات عديدة على انقضاء خدمتها، إلا أنها لا تزال
            تحتل مكانة خاصة في تاريخ الطيران.
          </p>
          <p style={styles.p}>
            كانت الكونكورد بمثابة سفينة رائدة في سماء السفر الجوي، فهي الطائرة الوحيدة في عالم الطيران
            التجاري التي استطاعت تحقيق سرعة تفوق ضعف سرعة الصوت بمقدار 2.04 ماخ، مما جعلها تأخذ الجدارة
            بلقب "ملكة السرعة في السماء".
          </p>
          <p style={styles.p}>
            كانت تتسع كونكورد لعدد يتراوح بين 92 إلى 128 شخصًا، مما جعلها تخدم الركاب بأسلوب فاخر ومريح.
            انطلقت أول رحلة لها في عام 1969، ودخلت رسمياً الخدمة في عام 1976. ومع ذلك، كان مصيرها
            محتومًا في عام 2003 بسبب التحديات المالية الهائلة التي تكبدتها.
          </p>
          <p style={styles.p}>
            لم تكن كونكورد مجرد طائرة، بل كانت رمزًا للتفوق التكنولوجي والريادة في عالم الطيران. على
            الرغم من الصعاب والتحديات التي واجهتها، لا تزال تحظى بتقدير وإعجاب العديد من الأشخاص حول
            العالم، وذلك كما رمز لإرث رائع في عالم الطيران.
          </p>
        </section>

        <section style={styles.section}>
          <h2 style={styles.h2}>سرعة الصوت</h2>
          <p style={styles.p}>
            تجسّدت أهمية سرعة الصوت بشكل لا يُمكن تجاهله في تصميم الطائرة الكونكورد، حيث كانت هذه
            العناصر الحاسمة تلعب دورًا مهما في هذا الإنجاز التقني الرائع
          </p>
          <p style={styles.p}>
            الاستغلال الأمثل للوقت: إحدى أهم مزايا الكونكورد كانت قدرتها على تقليل أوقات السفر بشكل
            كبير. بفضل سرعتها الفائقة، كان بإمكان المسافرين الوصول إلى وجهاتهم بسرعة لم يسبق لها مثيل.
          </p>
          <p style={styles.p}>
            الكفاءة الاقتصادية: على الرغم من تكاليف التشغيل العالية للكونكورد، إلا أنها كانت تهدف إلى
            تقديم تجربة سفر فاخرة وسريعة للركاب ذوي الدخل العالي. كانت هذه الطائرة خيارًا فريدًا وجاذبًا
            للركاب الذين يقدرون الوقت والسرعة.
          </p>
          <p style={styles.p}>
            تحديات التكنولوجيا والهندسة: تحقيق السرعة الفائقة للكونكورد كان تحديًا هندسيًا ضخمًا.
            تطلبت هذه السرعة تصميم هياكل ومحركات وأنظمة معقدة للتعامل مع القوى العالية وتأثيرات الطيران
            بسرعة فائقة.
          </p>
          <p style={styles.p}>
            الابتكار والريادة: كان تصميم وتطوير الكونكورد وتحقيق السرعة الفائقة تجسيدًا للابتكار والريادة
            في صناعة الطيران. كانت هذه الطائرة تمثل رمزًا لقدرة الإنسان على تحقيق المستحيل والتغلب على
            التحديات التقنية.
          </p>
        </section>

        <section style={styles.section}>
          <h2 style={styles.h2}>ماضٍ ومستقبل</h2>
          <p style={styles.p}>
            شهدت طائرة الكونكورد حوادث مأساوية اثنتين سلطت الضوء على مسألة سلامتها وأثرت على مجريات
            النقاشات. في عام 1973، وقعت حادثة في مطار باريس-شارل ديغول أسفرت عن وفاة 113 شخصًا، وكذلك في
            عام 2000 حين وقع حادث آخر في مطار سانتاجو دي كومبوستيلا بإسبانيا أيضًا أسفر عن وفاة 113
            شخصًا. تلك الحوادث دفعت إلى إجراء تعديلات جوهرية في تصميم الكونكورد وإجراءات السلامة بهدف
            تعزيزها.
          </p>
          <p style={styles.p}>
            وعلى الرغم من التحسينات التي أدخلت بعد هذين الحادثين، فقد بدأت الضغوط الاقتصادية والبيئية
            تلقي بظلالها على مستقبل الكونكورد. وفي النهاية، تم إيقاف خدماتها في عام 2003.
          </p>
          <p style={styles.p}>
            على الرغم من انتهاء خدمات الكونكورد، فإن تأثيرها الإيجابي لا يزال حاضرًا في صناعة الطيران.
            تعكس تجربة الكونكورد الفريدة والتكنولوجيا المتقدمة التي تم تطويرها خلال هذا المشروع الخبرات
            والمعرفة التي استفادت منها صناعة الطيران فيما بعد. وقد ساهمت هذه الخبرات في تطوير تقنيات
            ومفاهيم جديدة في مجال الطيران الفائق والنقل الجوي السريع، مما يظل إرث الكونكورد حيًا وملهمًا
            للمستقبل.
          </p>
        </section>
      </body>
    </div>
  );
};

export default Concorde;
