import React from 'react';
import { Link } from 'react-router-dom';

const Concorde = () => {
  const styles = {
    body: {
      fontFamily: 'ibmReg, sans-serif',
      textAlign: 'center',
      margin: 0,
      padding: 0,
      backgroundColor: 'rgb(254, 254, 236)',
    },
    h2: {
      fontSize: '50px',
      marginTop: '50px',
      fontFamily: 'ibmMed, sans-serif',
      color: 'white',
    },
    p: {
      fontSize: '20px',
      lineHeight: '2rem',
      textAlign: 'center',
      margin: '20px auto',
      maxWidth: '80%',
      fontFamily: 'ibmReg, sans-serif',      
      color: 'white',
    },
    backButton: {
      position: 'fixed',
      top: '20px',
      right: '20px',
      backgroundColor: 'rgba(255, 255, 255, 0.05)',
      backdropFilter: 'blur(17px)',
      borderColor: 'rgba(255, 255, 255, 0.05)',
      color: 'white',
      padding: '10px 20px',
      border: 'solid',
      cursor: 'pointer',
      fontFamily: 'ibmMed, sans-serif',      
      fontSize: '20px',
      borderRadius: '10px',
      zIndex: 10000
    },
    section: {
      marginTop: '50px',
      marginBottom: '50px',
      display: 'flex',
      alignItems: 'center',
      justifyContent: 'center',
      flexDirection: 'column',
      //backgroundColor: 'rgba(255, 255, 255, 0.05)',
      //backdropFilter: 'blur(17px)'
    },
    mediaQuery: {
      '@media screen and (maxWidth: 768px)': {
        h2: {
          fontSize: '35px',
        },
        p: {
          fontSize: '16px',
          lineHeight: '20px',
        }        
      },
    },
  };

  return (
    <div>
      <head>
        <meta charSet="UTF-8" />
        <meta name="viewport" content="width=device-width, initial-scale=1.0" />
        <link type="image/png" sizes="32x32" rel="icon" href="../../img/favicon/riyad.png" />
        <title>رياض شاجرة | أطول رحلة في التاريخ</title>
      </head>
      <body style={styles.body}>
        <Link to={"/"}>
          <button style={styles.backButton}>رجوع</button>
        </Link>
        <section style={styles.section}>
          <h2 style={styles.h2}>الإعداد والتحضيرات</h2>
          <p style={styles.p}>
          قبل بدء الرحلة التاريخية، كانت هناك تحضيرات مكثفة لضمان نجاح المهمة. تضمن ذلك تعديل طائرة "سيسنا 172" لتكون قادرة على تحمل مدة الطيران الطويلة. شملت التعديلات إضافة خزانات وقود إضافية، وتعزيز هيكل الطائرة ليتحمل الضغوط المستمرة. كان من الضروري أيضاً تجهيز الطائرة بأنظمة متقدمة لتتبع الأداء وتسجيل البيانات لضمان سلامة الرحلة واستمراريتها.
          </p>
          <p style={styles.p}>
          كان التخطيط للرحلة يشمل أيضاً تحضير فريق الدعم الأرضي، الذي كان مسؤولاً عن توفير الوقود والإمدادات الأخرى للطائرة. تم تطوير نظام فريد لتزويد الطائرة بالوقود أثناء الطيران باستخدام شاحنة متحركة مزودة بتقنيات حديثة. كان هذا يتطلب تنسيقاً دقيقاً بين الطائرة والشاحنة لضمان عملية تزويد الوقود بسلاسة ودون أي تعثر.
          </p>
          <p style={styles.p}>
          تضمن الإعداد أيضاً تدريب الطيارين على إدارة الرحلة الطويلة والتعامل مع التحديات التي قد تواجههم أثناء الطيران. كان من الضروري أن يكون تيم وكوك قادرين على التعامل مع مشكلات الطيران المختلفة، بما في ذلك الأعطال الفنية والظروف الجوية الصعبة التي قد تطرأ في أي وقت. كما تم تحضير استراتيجيات للتعامل مع أي حالات طوارئ قد تطرأ أثناء الرحلة لضمان استمرارها بشكل آمن وفعّال.
          </p>
          {/*<p style={styles.p}>
           
          </p>*/}
        </section>

        <section style={styles.section}>
          <h2 style={styles.h2}>التحديات والابتكارات</h2>
          <p style={styles.p}>
          واجهت الرحلة الطويلة العديد من التحديات التي تطلبت ابتكارات غير عادية للتغلب عليها. واحدة من أكبر التحديات كانت الحفاظ على إمدادات الوقود للطائرة دون هبوط. تم تصميم نظام فريد لتزويد الطائرة بالوقود من شاحنة متحركة عبر أنبوب طويل، وهو ابتكار لم يكن متاحاً في ذلك الوقت. هذا النظام كان يتطلب تنسيقاً دقيقاً بين الطائرة والشاحنة لضمان عملية تزويد الوقود بسلاسة.          </p>
          <p style={styles.p}>
          التحدي الآخر كان إدارة نظام التغذية والراحة للطائرين. بسبب طول الرحلة، كان لابد من توفير طعام وماء ووسائل نوم داخل الطائرة. تم تجهيز الطائرة بوسائل أساسية لتلبية هذه الاحتياجات، مثل تخزين الطعام المعلب والماء، وتوفير أماكن ضيقة للنوم. هذا الترتيب لم يكن مريحاً ولكنه كان ضرورياً للحفاظ على طاقتهما وأداءهما الجيد أثناء الرحلة الطويلة.          </p>
          <p style={styles.p}>
          واجه الطياران أيضاً تحديات تتعلق بالظروف الجوية المتقلبة. أثناء الرحلة، كان عليهما التعامل مع تغييرات مفاجئة في الطقس، بما في ذلك الحرارة الشديدة والرياح القوية التي قد تؤثر على استقرار الطائرة. كان هذا يتطلب منهما مراقبة مستمرة وتعديل استراتيجيات الطيران بناءً على الظروف الجوية المتغيرة. القدرة على التكيف مع هذه التغييرات كانت ضرورية لاستمرار الرحلة بنجاح.
          </p>
          {/* <p style={styles.p}>
            تحديات التكنولوجيا والهندسة: تحقيق السرعة الفائقة للكونكورد كان تحديًا هندسيًا ضخمًا.
            تطلبت هذه السرعة تصميم هياكل ومحركات وأنظمة معقدة للتعامل مع القوى العالية وتأثيرات الطيران
            بسرعة فائقة.
          </p> */}
          {/* <p style={styles.p}>
            الابتكار والريادة: كان تصميم وتطوير الكونكورد وتحقيق السرعة الفائقة تجسيدًا للابتكار والريادة
            في صناعة الطيران. كانت هذه الطائرة تمثل رمزًا لقدرة الإنسان على تحقيق المستحيل والتغلب على
            التحديات التقنية.
          </p> */}
        </section>

        <section style={styles.section}>
          <h2 style={styles.h2}>نتائج التجربة</h2>
          <p style={styles.p}>
          رحلة روبرت تيم وجون كوك لم تكن مجرد إنجاز في مجال الطيران، بل كانت أيضاً خطوة هامة في رفع الوعي حول قضايا مهمة. من خلال جمع الأموال لمستشفى السرطان ب لاس فيغاس، حيث ساهمت الرحلة في دعم أبحاث السرطان وتعزيز الجهود المبذولة لمكافحة المرض بشكل فعال. هذا الجانب الخيري من الرحلة كان له تأثير إيجابي كبير على المجتمع وتلقى إشادة واسعة.
          </p>
          <p style={styles.p}>
          تأثير الرحلة كان أيضاً ملموساً في مجال الطيران بشكل عام. الإنجاز الذي حققاه ألهم العديد من الطيارين والمخترعين لتحدي الحدود وتحقيق إنجازات جديدة في هذا المجال. الطيران المستمر دون هبوط أصبح معيارًا للابتكار في هذا القطاع، وشجع على تطوير تقنيات جديدة لتحسين كفاءة الرحلات الطويلة وجعلها أكثر فعالية.          </p>
          <p style={styles.p}>
          علاوة على ذلك، أظهرت الرحلة قدرة الإنسان على تحقيق المستحيل من خلال العمل الجماعي والتخطيط الدقيق. تعتبر تجربة تيم وكوك مثالاً على كيفية التعاون بين الأفراد والفِرق لتحقيق أهداف كبيرة ومؤثرة. الإرث الذي تركوه يعكس قوة الإرادة والابتكار، ويستمر في إلهام الأجيال القادمة لتحطيم الحدود وتحقيق الأهداف الطموحة.
          </p>
        </section>
      </body>
    </div>
  );
};

export default Concorde;
